Revit 2027 API
SurfaceDistributionRebarHandles Enumeration
 This enum represents the values that custom handles tags of RebarConstrainedHandle of Rebar Free Form Surface Distribution have. The tag of a [!:Autodesk::Revit::DB::Structure::RebarHandleType::CustomHandle] RebarConstrainedHandle can be obtained by calling the [!:Autodesk::Revit::DB::Structure::RebarConstrainedHandle::GetCustomHandleTag()]
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum SurfaceDistributionRebarHandles
Public Enumeration SurfaceDistributionRebarHandles
public enum class SurfaceDistributionRebarHandles
type SurfaceDistributionRebarHandles
Members
Member name | Value | Description
EndSurface | 2 |  Tag for handle representing the End Surface. This handle accepts constraints only to host faces or to covers.
HostSurface | 0 |  Tag for handle representing the Host Surface. This handle accepts constraints only to host faces or to covers.
StartSurface | 1 |  Tag for handle representing the Start Surface. This handle accepts constraints only to host faces or to covers.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace